In [1]:
import pandas as pd

In [9]:
# Cria um dicionário com autores, proços e tíyulos

dictionary = {'Autores' : ['Apolonio de Thodes', 'Homero', 'Harari', 'Joseph Campbell'],
             'Títulos' : ['Argonáutica', 'Ilíada','Sapiens', 'O Herói de mil faces'],
             'Preços' : [70, 40, 50, 60]}

In [41]:
## Dataframe

df1 = pd.DataFrame(dictionary)

In [43]:
df1

              Autores               Títulos  Preços
0  Apolonio de Thodes           Argonáutica      70
1              Homero                Ilíada      40
2              Harari               Sapiens      50
3     Joseph Campbell  O Herói de mil faces      60

In [45]:
df1['Autores']

0    Apolonio de Thodes
1                Homero
2                Harari
3       Joseph Campbell
Name: Autores, dtype: object

In [47]:
df1['Autores'][1]

'Homero'

In [49]:
df1['Preços']

0    70
1    40
2    50
3    60
Name: Preços, dtype: int64

In [51]:
df1['Preços'].mean()

55.0

In [53]:
mascara = (df1['Autores'] == 'Homero')

In [55]:
mascara

0    False
1     True
2    False
3    False
Name: Autores, dtype: bool

In [57]:
df1[mascara]

  Autores Títulos  Preços
1  Homero  Ilíada      40

In [71]:
# criando um novo dataframe

dictionary2 = ({'Autores' : ['Homero'], 'Títulos' : ['Odisséia'], 'Preços' : [50]})

In [73]:
df2 = pd.DataFrame(dictionary2)

In [75]:
df2

  Autores   Títulos  Preços
0  Homero  Odisséia      50

In [81]:
# Concatenando os dois dataframes

df_agrupado = pd.concat([df1, df2], ignore_index = True)

In [83]:
df_agrupado

              Autores               Títulos  Preços
0  Apolonio de Thodes           Argonáutica      70
1              Homero                Ilíada      40
2              Harari               Sapiens      50
3     Joseph Campbell  O Herói de mil faces      60
4              Homero              Odisséia      50